## Import Libraries and Dependencies

In [1]:
import os
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

#### Currnent Working Directory

In [2]:
os.getcwd()

'C:\\Users\\Chris\\Desktop\\Columbia\\Week_5\\Week_5_challenge'

In [3]:
path_20 = 'C:\\Users\\Chris\\Desktop\\Columbia\\Week_5\\Week_5_challenge\\Resources\\athletic_sales_2020.csv'
path_21 = 'C:\\Users\\Chris\\Desktop\\Columbia\\Week_5\\Week_5_challenge\\Resources\\athletic_sales_2021.csv'

#### Read the CSV files into DataFrames.

In [4]:
origin_20 = pd.read_csv(path_20)
origin_21 = pd.read_csv(path_21)

#### Copies

In [5]:
df_20 = origin_20.copy()
df_21 = origin_21.copy()

#### Display the 2020 sales DataFrame

In [6]:
df_20.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

#### Display the 2021 sales DataFrame

In [7]:
df_21.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

### Check the data types of each DataFrame

### 2020 file

In [8]:
df_20.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Re-Casting Features

In [9]:
df_20['retailer'] = df_20['retailer'].astype('category')
df_20['retailer_id'] = df_20['retailer_id'].astype('category')
df_20['region'] = df_20['region'].astype('category')
df_20['state'] = df_20['state'].astype('category')
df_20['city'] = df_20['city'].astype('category')
df_20['product'] = df_20['product'].astype('category')
df_20['sales_method'] = df_20['sales_method'].astype('category')
df_20['invoice_date'] = pd.to_datetime(df_20['invoice_date'])

C:\Users\Chris\AppData\Local\Temp\ipykernel_18284\1591990151.py:8: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_20['invoice_date'] = pd.to_datetime(df_20['invoice_date'])

#### Info summary

In [10]:
df_20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1297 entries, 0 to 1296
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          1297 non-null   category
 1   retailer_id       1297 non-null   category
 2   invoice_date      1297 non-null   datetime64[ns]
 3   region            1297 non-null   category
 4   state             1297 non-null   category
 5   city              1297 non-null   category
 6   product           1297 non-null   category
 7   price_per_unit    1297 non-null   int64
 8   units_sold        1297 non-null   int64
 9   total_sales       1297 non-null   int64
 10  operating_profit  1297 non-null   float64
 11  sales_method      1297 non-null   category
dtypes: category(7), datetime64[ns](1), float64(1), int64(3)
memory usage: 61.3 KB

In [11]:
df_20.describe(include=['int64','float64'])

       price_per_unit   units_sold    total_sales  operating_profit
count     1297.000000  1297.000000    1297.000000       1297.000000
mean        50.632999   355.053200  139833.555127      48640.429561
std         14.036694   276.512799  190202.261072      70290.181372
min         20.000000     7.000000     224.000000        112.000000
25%         40.000000   152.000000    7560.000000       3207.750000
50%         50.000000   250.000000   12688.000000       5686.200000
75%         60.000000   500.000000  276250.000000      85312.500000
max        100.000000  1275.000000  780000.000000     390000.000000

### 2021 file

In [12]:
df_21.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Re-Casting Features

In [13]:
df_21['retailer'] = df_21['retailer'].astype('category')
df_21['retailer_id'] = df_21['retailer_id'].astype('category')
df_21['region'] = df_21['region'].astype('category')
df_21['state'] = df_21['state'].astype('category')
df_21['city'] = df_21['city'].astype('category')
df_21['product'] = df_21['product'].astype('category')
df_21['sales_method'] = df_21['sales_method'].astype('category')
df_21['invoice_date'] = pd.to_datetime(df_21['invoice_date'])

C:\Users\Chris\AppData\Local\Temp\ipykernel_18284\1739822351.py:8: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_21['invoice_date'] = pd.to_datetime(df_21['invoice_date'])

#### Info summary

In [14]:
df_21.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8346 entries, 0 to 8345
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          8346 non-null   category
 1   retailer_id       8346 non-null   category
 2   invoice_date      8346 non-null   datetime64[ns]
 3   region            8346 non-null   category
 4   state             8346 non-null   category
 5   city              8346 non-null   category
 6   product           8346 non-null   category
 7   price_per_unit    8346 non-null   int64
 8   units_sold        8346 non-null   int64
 9   total_sales       8346 non-null   int64
 10  operating_profit  8346 non-null   float64
 11  sales_method      8346 non-null   category
dtypes: category(7), datetime64[ns](1), float64(1), int64(3)
memory usage: 387.0 KB

In [15]:
df_21.describe(include=['int64','float64'])

       price_per_unit   units_sold    total_sales  operating_profit
count     8346.000000  8346.000000    8346.000000       8346.000000
mean        44.372154   241.614186   86007.842080      32202.144605
std         14.631328   198.512997  131330.187492      50863.758202
min          7.000000     0.000000       0.000000          0.000000
25%         35.000000   101.000000    3904.500000       1774.927500
50%         45.000000   173.000000    8620.000000       4019.040000
75%         54.000000   325.000000  136875.000000      48125.000000
max        110.000000  1150.000000  825000.000000     371250.000000

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

### Combine the sales data by rows.

#### Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.

In [16]:
df = pd.concat(objs=[df_20,df_21],join= 'inner')
df.reset_index(inplace=True,drop=True)

#### Exploring combined data

In [17]:
df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [18]:
df.tail()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
9638,Foot Locker,1185732,2021-12-31,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
9639,Foot Locker,1185732,2021-12-31,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
9640,Amazon,1185732,2021-12-31,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
9641,Amazon,1185732,2021-12-31,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
9642,Foot Locker,1185732,2021-12-31,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

#### Re-Casting Features

In [19]:
df['retailer'] = df['retailer'].astype('category')
df['retailer_id'] = df['retailer_id'].astype('category')
df['region'] = df['region'].astype('category')
df['state'] = df['state'].astype('category')
df['city'] = df['city'].astype('category')
df['product'] = df['product'].astype('category')
df['sales_method'] = df_21['sales_method'].astype('category')
#################################################################
#################################################################
# Casting df['invoice_date'] column to datetime
df['invoice_date'] = pd.to_datetime(df['invoice_date'])

#### Info summary

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9643 entries, 0 to 9642
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9643 non-null   category
 1   retailer_id       9643 non-null   category
 2   invoice_date      9643 non-null   datetime64[ns]
 3   region            9643 non-null   category
 4   state             9643 non-null   category
 5   city              9643 non-null   category
 6   product           9643 non-null   category
 7   price_per_unit    9643 non-null   int64
 8   units_sold        9643 non-null   int64
 9   total_sales       9643 non-null   int64
 10  operating_profit  9643 non-null   float64
 11  sales_method      8346 non-null   category
dtypes: category(7), datetime64[ns](1), float64(1), int64(3)
memory usage: 448.6 KB

In [21]:
df.describe(include=['int64','float64'])

       price_per_unit   units_sold    total_sales  operating_profit
count     9643.000000  9643.000000    9643.000000       9643.000000
mean        45.214249   256.871928   93247.492585      34413.122058
std         14.708018   214.200195  141871.254293      54172.533684
min          7.000000     0.000000       0.000000          0.000000
25%         35.000000   106.000000    4250.000000       1919.155000
50%         45.000000   176.000000    9576.000000       4368.000000
75%         55.000000   350.000000  150000.000000      52031.250000
max        110.000000  1275.000000  825000.000000     390000.000000

#### Check if any values are null.

In [22]:
df.isna().sum()

retailer               0
retailer_id            0
invoice_date           0
region                 0
state                  0
city                   0
product                0
price_per_unit         0
units_sold             0
total_sales            0
operating_profit       0
sales_method        1297
dtype: int64

#### Checking column data type

In [23]:
df.dtypes

retailer                  category
retailer_id               category
invoice_date        datetime64[ns]
region                    category
state                     category
city                      category
product                   category
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method              category
dtype: object

### <font color='blue'>Note:</font> 
**<font color='gray'>The 'invoice_date' column was already cast as date time in ther 'Re-casting' section,<br>
the column data type can be confirmed in 'Checking column data type' section, below the data type of a <br>
single entry is displayed</font>**

#### Confirming 'invoice date' entry data type

In [33]:
df['invoice_date'][0]

Timestamp('2020-01-01 00:00:00')

### 2. Determine which Region Sold the Most Products

### Using `groupby`

#### Show the number products sold for region, state, and city.

In [34]:
groupby_df = df.groupby(['region','state','city'])[['units_sold']].sum()
groupby_df.head()

C:\Users\Chris\AppData\Local\Temp\ipykernel_18284\1176705585.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groupby_df = df.groupby(['region','state','city'])[['units_sold']].sum()

                             units_sold
region  state   city
Midwest Alabama Albany                0
                Albuquerque           0
                Anchorage             0
                Atlanta               0
                Baltimore             0

#### Rename the sum to "Total_Products_Sold"

In [35]:
groupby_df.rename(columns={'units_sold':'Total_Products_Sold'},inplace=True)

#### Show the top 5 results

In [36]:
groupby_df.sort_values(by='Total_Products_Sold',ascending = False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### Using `pivot_table`

#### Show the number products sold for region, state, and city

In [37]:
pivot_table_df = pd.pivot_table(df,index = ['region','state','city'],values = 'units_sold',aggfunc = 'sum')
pivot_table_df.head()

                             units_sold
region  state   city
Midwest Alabama Albany                0
                Albuquerque           0
                Anchorage             0
                Atlanta               0
                Baltimore             0

#### Rename the "units_sold" column to "Total_Products_Sold"

In [38]:
pivot_table_df.rename(columns={'units_sold':'Total_Products_Sold'},inplace=True)

#### Show the top 5 results

In [39]:
pivot_table_df.sort_values(by='Total_Products_Sold',ascending = False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

#### Show the region with most sales for region, state, and city.

In [40]:
groupby_sales_df = df.groupby(['region','state','city'])[['total_sales']].sum()
groupby_sales_df.head()

C:\Users\Chris\AppData\Local\Temp\ipykernel_18284\4076364258.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groupby_sales_df = df.groupby(['region','state','city'])[['total_sales']].sum()

                             total_sales
region  state   city
Midwest Alabama Albany                 0
                Albuquerque            0
                Anchorage              0
                Atlanta                0
                Baltimore              0

#### Rename total_sales to Total Sales

In [41]:
groupby_sales_df.rename(columns={'total_sales':'Total Sales'},inplace=True)

#### Show the top 5 results

In [42]:
groupby_sales_df.sort_values(by='Total Sales', ascending = False,inplace = True)
groupby_sales_df.head()

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### Using `pivot_table`

#### Show the total sales for the products sold for each region, state, and city

In [44]:
pivot_table_sales_df = pd.pivot_table(df,index = ['region','state','city'],values = 'total_sales',aggfunc = 'sum')
pivot_table_sales_df.head()

                             total_sales
region  state   city
Midwest Alabama Albany                 0
                Albuquerque            0
                Anchorage              0
                Atlanta                0
                Baltimore              0

#### Optional: Rename the "total_sales" column to "Total Sales"

In [52]:
pivot_table_sales_df.rename(columns = {'total_sales':'Total Sales'},inplace = True)

#### Show the top 5 results

In [53]:
pivot_table_sales_df.sort_values(by='Total Sales',inplace = True,ascending = False)
pivot_table_sales_df.head()

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

### Using `groupby`

##### Show the total sales for the products sold for each retailer, region, state, and city

In [62]:
groupby_retailer_df = df.groupby(['retailer','region','state','city'])[['total_sales']].sum()
groupby_retailer_df.head()

C:\Users\Chris\AppData\Local\Temp\ipykernel_18284\3439291661.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groupby_retailer_df = df.groupby(['retailer','region','state','city'])[['total_sales']].sum()

                                      total_sales
retailer region  state   city
Amazon   Midwest Alabama Albany                 0
                         Albuquerque            0
                         Anchorage              0
                         Atlanta                0
                         Baltimore              0

#### Rename the "total_sales" column to "Total Sales"

In [63]:
groupby_retailer_df.rename(columns = {'total_sales':'Total Sales'},inplace = True)

#### Show the top 5 results

In [64]:
groupby_retailer_df.sort_values(by='Total Sales',inplace = True,ascending = False)
groupby_retailer_df.head()

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### Using `pivot_table`

#### Show the total sales for the products sold for each retailer, region, state, and city

In [65]:
pivot_table_retailer_df = pd.pivot_table(df,index = ['retailer','region','state','city'],values = 'total_sales',aggfunc = 'sum')
pivot_table_retailer_df.head()

                                      total_sales
retailer region  state   city
Amazon   Midwest Alabama Albany                 0
                         Albuquerque            0
                         Anchorage              0
                         Atlanta                0
                         Baltimore              0

#### Optional: Rename the "total_sales" column to "Total Sales"

In [66]:
pivot_table_retailer_df.rename(columns = {'total_sales':'Total Sales'},inplace = True)

#### Show the top 5 results

In [67]:
pivot_table_retailer_df.sort_values(by='Total Sales',inplace = True,ascending = False)
pivot_table_retailer_df.head()

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

#### Filter the sales data to get the women's athletic footwear sales data.

In [73]:
waf_df = df.loc[df['product']=="Women's Athletic Footwear"]
waf_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Online
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,Online
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Online
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

### Using `groupby`

#### Show the total number of women's athletic footwear sold for each retailer, region, state, and city

In [76]:
groupby_waf_df = waf_df.groupby(['retailer','region','state','city'])[['units_sold']].sum()
groupby_waf_df.head()

C:\Users\Chris\AppData\Local\Temp\ipykernel_18284\3315287653.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groupby_waf_df = waf_df.groupby(['retailer','region','state','city'])[['units_sold']].sum()

                                      units_sold
retailer region  state   city
Amazon   Midwest Alabama Albany                0
                         Albuquerque           0
                         Anchorage             0
                         Atlanta               0
                         Baltimore             0

#### Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

In [77]:
groupby_waf_df.rename(columns = {'units_sold':'Womens_Footwear_Units_Sold'},inplace = True)

#### Show the top 5 results

In [79]:
groupby_waf_df.sort_values(by = 'Womens_Footwear_Units_Sold',inplace = True,ascending = False)
groupby_waf_df.head()

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

#### Using `pivot_table`

#### Show the total number of women's athletic footwear sold for each retailer, region, state, and city

In [81]:
pivot_table_waf_df = pd.pivot_table(waf_df,index = ['retailer','region','state','city'],values = 'units_sold',aggfunc = 'sum')
pivot_table_waf_df.head()

                                      units_sold
retailer region  state   city
Amazon   Midwest Alabama Albany                0
                         Albuquerque           0
                         Anchorage             0
                         Atlanta               0
                         Baltimore             0

#### Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

In [82]:
pivot_table_waf_df.rename(columns = {'units_sold':'Womens_Footwear_Units_Sold'},inplace = True)

#### Show the top 5 results

In [83]:
pivot_table_waf_df.sort_values(by = 'Womens_Footwear_Units_Sold',inplace = True,ascending = False)
pivot_table_waf_df.head()

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

#### Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values

In [97]:
w_pvt_df = pd.pivot_table(waf_df,index = 'invoice_date',values = 'total_sales',aggfunc='sum')
w_pvt_df.head()

              total_sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250

#### Optional: Rename the "total_sales" column to "Total Sales"

In [98]:
w_pvt_df.rename(columns = {'total_sales':'Total Sales'},inplace = True)

#### Show the table

In [100]:
w_pvt_df.head()

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250

#### Apply resample method to the pivot_table
**Place the data into daily bins, and get the total sales for each day.**

In [106]:
daily_resample_df = w_pvt_df.resample('D').sum()
daily_resample_df.head()

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-06              0
2020-01-07              0
2020-01-08              0

#### Sorting dataframe in <font color=red>(descending)</font> order

In [114]:
daily_resample_df.sort_values(by='Total Sales',ascending = False, inplace = True)

#### Show the table <font color=red>(descending)</font>

In [108]:
daily_resample_df.head(10)

              Total Sales
invoice_date
2021-07-16        1521825
2021-12-16        1473497
2021-06-17        1376988
2021-08-17        1086294
2021-07-23        1021806
2021-11-17        1021145
2021-12-09         915011
2021-06-24         884238
2021-07-09         869054
2021-08-10         839120

#### Sorting dataframe in <font color=red>(ascending)</font>

In [109]:
daily_resample_df.sort_values(by='Total Sales', inplace = True)

#### Show the table <font color=red>(ascending)</font>

In [110]:
daily_resample_df.head(10)

              Total Sales
invoice_date
2020-04-12              0
2020-03-25              0
2020-03-26              0
2020-03-27              0
2021-08-31              0
2021-08-30              0
2021-08-29              0
2020-03-28              0
2021-08-27              0
2020-03-23              0

### <font color=blue>Note:</font>
**In the instrocutions on the notebook it asks for the tabel to be shown in ascending order, and on the BCS module 5 it <br>
asks for the table to be shown in descending order above you have both**

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

#### Resample the pivot table into weekly bins, and get the total sales for each week

In [111]:
weekly_resample_df = w_pvt_df.resample('W').sum()

#### Sorting dataframe in <font color=red>(descending)</font> order

In [112]:
weekly_resample_df.sort_values(by='Total Sales',ascending = False, inplace = True)

#### Show the table <font color=red>(descending)</font>

In [113]:
weekly_resample_df.head(10)

              Total Sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2021-07-18        2801449
2021-11-14        2531721
2021-08-22        2491259
2021-08-15        2463941
2021-11-21        2449537
2021-05-16        2422132
2021-06-13        2358602

#### Sorting dataframe in <font color=red>(ascending)</font>

In [115]:
weekly_resample_df.sort_values(by='Total Sales', inplace = True)

#### Show the table <font color=red>(ascending)</font>

In [116]:
weekly_resample_df.head(10)

              Total Sales
invoice_date
2020-10-18              0
2020-11-22          53940
2020-12-13          58916
2020-12-20          61710
2020-12-06          62801
2020-11-29          71938
2020-03-29         112592
2020-03-22         115232
2021-08-01         125495
2020-01-12         129556

### <font color=blue>Note:</font>
**In the instrocutions on the notebook it asks for the tabel to be shown in ascending order, and on the BCS module 5 it <br>
asks for the table to be shown in descending order above you have both**